/* Error description for invalid business type. */
"error_invalid_business_type" = "Business type is invalid.";

/* Error description for invalid DSP ID. */
"error_invalid_dsp_id" = "DSP id is invalid.";

/* Error description for invalid manifest file. */
"error_invalid_manifest_file" = "Invalid dsp manifest file. Please recheck and configure again.";

/* Error description for invalid protocol. */
"error_invalid_protocol" = "Invalid protocol, secure protocol HTTPS is only supported.";

/* Error description for invalid journey type. */
"error_invalid_journey_type" = "Journey type is invalid.";

/* Error description for invalid lifecycle ID. */
"error_invalid_lifecycle_id" = "Lifecycle id is invalid.";

/* Error description - connection error. */
"error_no_internet" = "Network connection not available. Please try to connect before using.";

/* Error description - some technical error. */
"error_technical" = "Technical Error.";

/* Error description - timeout error. */
"error_timeout" = "Technical error occurred request timeout.";

/* Error description - failed to invode DSP app. */
"error_invoke" = "Unable to open DSP app.";

/* Error description for invalid manifest URL. */
"error_invalid_manifest_url" = "Unable to reach to configured URL. Please check and reconfigure dsp manifest file URL.";

